Core/src/InformationRegisters/НДФЛСтандартныеЛичныеВычеты/НДФЛСтандартныеЛичныеВычеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НДФЛСтандартныеЛичныеВычеты</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Применяется</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КодВычета</name>
    <type>
      <types>CatalogRef.ВычетыНДФЛ</types>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/НДФЛСтандартныеЛичныеВычеты/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Запись.Применяется Тогда
			Запись.Представление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.КодВычета,"Наименование");
		Иначе
				Запись.Представление =  НСтр("ka='სტანდარტული პირადი დაქვითვა არ გამოიყენება';ru='Стандартный личный вычет не применяется'");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
